Repository: bogdanbabych/0945BUT10201-lex-term
Catalog: data/archive/t002-gnu-en-de.tmx
Source language: en
Languages: de

source: Why Educational Institutions Should Use and Teach Free Software
de: Warum Bildungseinrichtungen Freie Software nutzen und lehren sollten

source: "Schools should teach their students to be citizens of a strong, capable, independent and free society."
de: „Schulen sollten ihren Schülerinnen und Schülern lehren, Bürger einer starken, fähigen, unabhängigen und freien Gesellschaft zu sein.“

source: These are the main reasons why universities and schools of all levels should use exclusively Free Software.
de: Dies sind die wichtigsten Gründe, warum Universitäten und alle Schultypen ausschließlich Freie Software verwenden sollten.

source: Sharing
de: Gemeinsame Nutzung

source: Schools should teach the value of sharing by setting an example.
de: Schulen sollten den Wert des Teilens mit einem Beispiel lehren.

source: Free software supports education by allowing the sharing of knowledge and tools:
de: Freie Software fördert die Bildung durch den Austausch von Wissen und Dienstprogrammen:

source: Knowledge .
de: Wissen .

source: Many young students have a talent for programming; they are fascinated with computers and eager to learn how their systems work.
de: Viele junge SchülerInnen haben ein Talent für die Programmierung; sie sind von Rechnern fasziniert und begierig zu erfahren, wie ihre Systeme funktionieren.

source: With proprietary software, this information is a secret so teachers have no way of making it available to their students.
de: Diese Informationen sind bei proprietärer Software geheim Lehrkräfte haben keine Möglichkeit, diese ihren SchülerInnen zugänglich zu machen.

source: But if it is Free Software, the teacher can explain the basic subject and then hand out the source code for the student to read and learn.
de: Ist es aber Freie Software, kann die Lehrkraft das wesentliche zum Thema erklären und dann den Quellcode zum Lesen und Lernen an die SchülerInnen aushändigen.

source: Tools .
de: Dienstprogramme .

source: Teachers can hand out to students copies of the programs they use in the classroom so that they can use them at home.
de: Lehrkräfte können SchülerInnen im Unterricht genutzte Programmkopien austeilen, damit sie sie zu Hause verwenden können.

source: With Free Software, copying is not only authorized, it is encouraged.
de: Mit freier Software ist das Kopieren nicht nur erlaubt, es ist erwünscht.

source: Social Responsibility
de: Gesellschaftliche Verantwortung

source: Computing has become an essential part of everyday life.
de: Die Datenverarbeitung ist zu einem wesentlichen Teil des Alltags geworden.

source: Digital technology is transforming society very quickly, and schools have an influence on the future of society.
de: Digitale Technologie verwandelt die Gesellschaft sehr schnell, und Schulen haben einen Einfluss auf die Zukunft der Gesellschaft.

source: Their mission is to get students ready to participate in a free digital society by teaching them the skills to make it easy for them to take control of their own lives.
de: Ihre Aufgabe ist es, SchülerInnen für die Teilnahme an einer freien digitalen Gesellschaft vorzubereiten, um es ihnen einfacher zu machen, ihr eigenes Leben selbst in die Hand zu nehmen.

source: Software should not be under the power of a software developer who unilaterally makes decisions that nobody else can change.
de: Software sollte nicht unter der Macht eines Softwareentwicklers stehen, der einseitige Entscheidungen treffen kann, die niemand sonst ändern kann.

source: Educational institutions should not allow proprietary software companies to impose their power on the rest of society and its future.
de: Bildungseinrichtungen sollten proprietären Softwareunternehmen nicht erlauben, deren Macht dem Rest der Gesellschaft und seiner Zukunft aufzuerlegen.

source: Independence
de: Unabhängigkeit

source: Schools have an ethical responsibility to teach strength, not dependency on a single product or a specific powerful company.
de: Schulen haben eine ethische Verantwortung, Stärke, und nicht die Abhängigkeit eines einzelnen Produkts oder eines bestimmten mächtigen Unternehmen, zu lehren.

source: Furthermore, by choosing to use Free Software, the school itself gains independence from any commercial interests and it avoids vendor lock-in.
de: Darüber hinaus erhält die Schule selbst, durch die Wahl Freie Software zu nutzen, Unabhängigkeit von kommerziellen Interessen und vermeidet Herstellerabhängigkeiten.

source: Proprietary software companies use schools and universities as a springboard to reach users and thus impose their software on society as a whole.
de: Proprietäre Softwarefirmen nutzen Schulen und Universitäten als Sprungbrett, um Nutzer zu erreichen und damit ihre Software der Gesellschaft als Ganzes aufzuerlegen.

source: They offer discounts, or even gratis copies of their proprietary programs to educational institutions, so that students will learn to use them and become dependent on them.
de: Sie bieten Bildungseinrichtungen Preisnachlässe oder sogar kostenlose Kopien ihrer proprietären Programme an, damit SchülerInnen deren Benutzung erlernen und von ihnen abhängig bzw. darauf angewiesen sein werden.

source: After these students graduate, neither they nor their future employers will be offered discounted copies.
de: Nachdem diese SchülerInnen später graduieren, werden weder ihnen noch deren künftigen Arbeitgebern ermäßigte Programmkopien angeboten.

source: Essentially, what these companies are doing is they are recruiting schools and universities into agents to lead people to permanent lifelong dependency.
de: Im Grunde werben diese Firmen Schulen und Universitäten als Mittler an, um Menschen in dauerhafte lebenslange Abhängigkeit zu führen.

source: Free software licenses do not expire, which means that once Free Software is adopted, institutions remain independent from the vendor.
de: Freie Softwarelizenzen sind unbegrenzt gültig einmal durch Einrichtungen angenommene Freie Software bleibt herstellerunabhängig.

source: Moreover, Free Software licenses grant users the rights not only to use the software as they wish, to copy it and distribute it, but also to modify it in order to meet their own needs.
de: Darüber hinaus gewähren freie Softwarelizenzen Nutzern nicht nur das Recht zur Nutzung, Vervielfältigung und Verbreitung der Software zu, sondern auch nach eigenen Bedürfnissen anzupassen.

source: Therefore, if institutions eventually wish to implement a particular function in a piece of software, they can engage the services of any developer to accomplish the task, independently from the original vendor.
de: Daher können Einrichtungen die Dienstleistung jedes möglichen Entwicklers zum Ausführen der Aufgabe, unabhängig vom ursprünglichen Hersteller, beauftragen, um letztlich bestimmte Softwarefunktionen zu implementieren.

source: Learning
de: Lernen

source: When deciding where they will study, more and more students are considering whether a university teaches computer science and software development using Free Software.
de: Bei der Auswahl des Studiums überlegen mehr und mehr künftige Studenten, ob eine Universität Informatik und Softwareentwicklung mit Freie Software unterrichtet.

source: Free software means that students are free to study how the programs work and to learn how to adapt them for their own needs.
de: Freie Software bedeutet, dass Studenten frei sind zu untersuchen, wie Programme arbeiten und zu erlernen, wie sie eigenen Bedürfnissen angepasst werden können.

source: Learning about Free Software also helps in studying software development ethics and professional practice.
de: Von Freie Software zu Lernen hilft auch bei der Untersuchung der ethischen Softwareentwicklung und der beruflichen Praxis.

source: Saving
de: Einsparung

source: This is an obvious advantage that will appeal immediately to many school administrators, but it is a marginal benefit.
de: Dies ist ein eindeutiger Vorteil, der sofort viele Schulleiter anspricht, aber nur ein geringfügiger Nutzen.

source: The main point of this aspect is that by being authorized to distribute copies of the programs at little or no cost, schools can actually aid families facing financial issues, thus promoting fairness and equal opportunities of learning among students.
de: Der wichtigste Punkt dieses Aspekts ist, durch die Berechtigung Programmkopien mit geringen oder gar keinen Kosten verbreiten zu können, Schulen tatsächlich Familien mit finanziellen Problemen helfen können und so Fairness und Chancengleichheit des Lernens unter den Studenten fördern.

source: Quality
de: Qualität

source: Stable, secure and easily installed Free Software solutions are available for education already.
de: Stabile, sichere und einfach zu installierende freie Softwarelösungen sind für den Unterricht bereits verfügbar.

source: In any case, excellence of performance is a secondary benefit; the ultimate goal is freedom for computer users.
de: In jedem Fall sind ausgezeichnete Performance ein Nebeneffekt; das oberste Ziel ist Freiheit für Rechnernutzer.
